# CADLinkOperations Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CADLinkOperations Methods
CADLinkOperations Class See Also
---
The CADLinkOperations type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from LinkOperations.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetOnLocalLinkSharedCoordinatesSavedCallback | Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer.  (Inherited from LinkOperations.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
CADLinkOperations Class
Autodesk.Revit.DB Namespace